Examinator/src/Catalogs/ШаблоныСУЗ/ШаблоныСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШаблоныСУЗ</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ПредставлениеИнформации</name>
      <description>Представление информации</description>
    </items>
  </predefined>
  <attributes>
    <name>ВидШаблона</name>
    <type>
      <types>EnumRef.ТипыОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополняетШаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТаблицыСтилей</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонПредставления</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонСкрипта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/Enums/ТипыШаблоновСУЗ/ТипыШаблоновСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыШаблоновСУЗ</name>
  <enumValues>
    <name>Представление</name>
  </enumValues>
  <enumValues>
    <name>Скрипт</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Catalogs/ШаблоныСУЗ/Forms/ФормаЭлемента/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура УстановитьДоступностьЭлементовФормыНаСервере()
	
	ЭтоНовый = ДанныеФормыВЗначение(Объект, Тип("СправочникОбъект.ШаблоныСУЗ")).ЭтоНовый();
	
	Если ЭтоНовый Тогда
		
		Элементы.ДополнительныеШаблоныСкрипта.Видимость = Ложь;
		Элементы.ДополнительныеШаблоныПредставления.Видимость = Ложь;
		Элементы.СписокПространствИмен.Видимость = Ложь;
		
	Иначе
		
		Элементы.ДополнительныеШаблоныСкрипта.Видимость = Истина;
		Элементы.ДополнительныеШаблоныПредставления.Видимость = Истина;
		Элементы.СписокПространствИмен.Видимость = Истина;
		
		// Устанавливаем отбор по владельцу
		
		ОбщегоНазначенияСУКлиентСервер.УстановитьОтборЭлементовДинамическогоСписка(ДополнительныеШаблоныСкрипта, Объект.Ссылка);
		ОбщегоНазначенияСУКлиентСервер.УстановитьОтборЭлементовДинамическогоСписка(ДополнительныеШаблоныПредставления, Объект.Ссылка);
		ОбщегоНазначенияСУКлиентСервер.УстановитьОтборЭлементовДинамическогоСписка(СписокПространствИмен, Объект.Ссылка);
		
		// Устанавливаем отбор по типу шаблона
		
		ОтборПоТипуШаблонаУжеДобавлен = Ложь;
		Для каждого ЭлементОтбора Из ДополнительныеШаблоныПредставления.Отбор.Элементы Цикл
			
			Если ЭлементОтбора.Представление = "Тип шаблона" Тогда
				ОтборПоТипуШаблонаУжеДобавлен = Истина;
				Прервать;
			КонецЕсли;
		
		КонецЦикла;
		
		Если НЕ ОтборПоТипуШаблонаУжеДобавлен Тогда
			
			ЭлементОтбора = ДополнительныеШаблоныПредставления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("ТипШаблона");
			ЭлементОтбора.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.Использование    = Истина;
			ЭлементОтбора.Представление    = "Тип шаблона";
			ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
			ЭлементОтбора.ПравоеЗначение   = Перечисления.ТипыШаблоновСУЗ.Представление;
			
			ЭлементОтбора = ДополнительныеШаблоныСкрипта.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("ТипШаблона");
			ЭлементОтбора.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.Использование    = Истина;
			ЭлементОтбора.Представление    = "Тип шаблона";
			ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
			ЭлементОтбора.ПравоеЗначение   = Перечисления.ТипыШаблоновСУЗ.Скрипт;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Идентификатор = Строка(Объект.Ссылка.УникальныйИдентификатор());
	
	УстановитьДоступностьЭлементовФормыНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Идентификатор = Строка(Объект.Ссылка.УникальныйИдентификатор());
		
	УстановитьДоступностьЭлементовФормыНаСервере();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНД

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЧНОГО ПОЛЯ <Наименование>
